library(tidyverse)

y2017 <- tribble(~구분, ~소계, ~가나, ~그리스, ~나이지리아, ~남아프리카공화국, ~네덜란드, ~네팔,
"계", 9089, 1, 47, 27, 33, 14, 688,
"남", 6538, 1, 35, 15, 19, 12, 671,
"여", 2551, NA, 12, 12, 14, 2, 17)

y2017_2 <- tribble(~구분, ~노르웨이, ~뉴질랜드, ~덴마크, ~도미니카공화국, ~독일, ~라오스, ~러시아,

"계", 474, 22, 24, 2, 23, 5, 50,
"남", 397, 19, 21, 1, 18, NA, 18,
"여", 77, 3, 3, 1, 5, 5, 32)

y2017_3 <- tribble(~구분, ~레바논, ~루마니아, ~리투아니아, ~마다가스카르, ~말레이시아, ~멕시코, ~모로코,
"계", 3, 48, 3, 2, 153, 1, 2,
"남", 2, 30, 2, NA, 114, 1, 1,
"여", 1, 18, 1, 2, 39, NA,1)

y2017_4 <- tribble(~구분, ~몽골, ~미국, ~미얀마, ~방글라데시, ~베네수엘라, ~베트남, ~벨기에,
"계", 43, 250, 370, 4, 10, 1086, 8,
"남", 32, 170, 368, 4, 5, 594, 5,
"여", 11, 80,2, NA, 5, 492, 3)

y2017_5 <- tribble(~구분, ~벨로루시, ~불가리아, ~브라질, ~브루나이, ~세르비아, ~스리랑카, ~스웨덴, ~스위스,

"계", 1, 6, 19, 1, 1, 397, 21, 4,
"남", 1, 3, 10, 1, 1, 393, 16, 3,
"여", NA, 3, 9 ,NA ,NA,4, 5, 1 )

y2017_6 <- tribble(~구분, ~스페인, ~슬로베니아, ~시리아, ~시에라리온, ~싱가포르, ~아르헨티나, ~아이슬란드, ~아일랜드,
                   "계", 4, 1, 1, 2, 42, 4, 4, 21,
                   "남", 2, 1, 1, 1, 32, 2, 2, 15,
                   "여", 2, NA, NA, 1, 10, 2, 2, 6 )

y2017_7 <- tribble(~구분, ~아제르바이잔, ~에스토니아, ~엘살바도르, ~영국, ~예멘공화국, ~오스트레일리아, ~오스트리아, ~우즈베키스탄,
                   "계", 2, 1, 1, 328, 1, 81, 1, 977,
                   "남", NA, 1, NA, 276, 1, 57, 1, 904,
                   "여", 2, NA, 1, 52 ,NA ,24 ,NA ,73 )

y2017_8 <- tribble(~구분, ~우크라이나, ~이란, ~이집트, ~이탈리아, ~인도, ~인도네시아, ~일본, ~중국,
                   "계", 20, 9, 4, 33, 427, 492, 127, 588,
                   "남", 11, 6, 2, 26, 246 ,453, 48, 240,
                   "여", 9 ,3 ,2 ,7, 181, 39, 79, 348 )

y2017_9 <- tribble(~구분, ~짐바브웨, ~칠레, ~카자흐스탄, ~캄보디아, ~캐나다, ~코트디부아르, ~콜롬비아, ~크로아티아,
                   "계", 1, 1, 49, 129, 39, 4, 2, 13,
                   "남", 1, NA, 28, 97 ,24 ,2 ,NA ,10,
                   "여", NA, 1, 21, 32 ,15 ,2 ,2 ,3 )

y2017_10 <- tribble(~구분, ~키르기스스탄, ~타이, ~타이완, ~터키, ~튀니지, ~티모르민주공화국, ~파키스탄, ~페루,
                    
                    "계", 23, 290, 25, 6, 6, 71, 13, 1,
                    "남", 14, 235, 10, 6, 2, 71, 7, 1,
                    "여", 9 ,55, 15, NA, 4, NA, 6, NA )

y2017_11 <- tribble(~구분, ~포르투갈, ~폴란드, ~프랑스, ~핀란드, ~필리핀, ~한국계중국인, ~헝가리, ~홍콩,
                    "계", 1, 25, 235, 7, 451, 678, 2, 3,
                    "남", 1, 19, 178, 6, 140, 371, 1, 3,
                    "여", NA, 6 ,57, 1, 311, 307, 1, NA )


y2017_df <- y2017 %>% 
  left_join(y2017_2) %>% 
  left_join(y2017_3) %>% 
  left_join(y2017_4) %>% 
  left_join(y2017_5) %>% 
  left_join(y2017_6) %>% 
  left_join(y2017_7) %>% 
  left_join(y2017_8) %>% 
  left_join(y2017_9) %>% 
  left_join(y2017_10) %>% 
  left_join(y2017_11)

y2017_tidy <- y2017_df %>% 
  gather(country, population, 소계:홍콩) %>% 
  spread(구분, population)

write_csv(y2017_tidy, "geoje/datasets/foreigner_2017.csv")

y2016_1 <- tribble(~구분, ~계, ~인도네시아, ~중국, ~스리랑카, ~필리핀, ~캄보디아, ~한국계중국인, ~미얀마,
                   "계", 14178, 897, 631, 641, 621, 184, 916, 484,
                   "남", 10545, 846, 263, 633, 215, 139, 526, 477,
                   "여", 3633, 51, 368, 8, 406, 45, 390, 7)

y2016_2 <-tribble(~구분, ~티모르민주공화국, ~베트남, ~몽골, ~타이, ~우즈베키스탄, ~일본, ~오스트레일리아, ~타이완,
                  "계", 70, 1228, 64, 445, 1342, 149, 846, 21,
                  "남", 70, 681, 49, 377, 1263, 70, 664, 9,
                  "여", NA, 547, 15, 68, 79, 79, 182, 12)

y2016_3 <- tribble(~구분, ~말레이시아, ~미국, ~네덜란드, ~라오스, ~이탈리아, ~키르기스스탄, ~노르웨이, ~영국,
                   "계", 220, 308, 68, 6, 51, 27, 704, 669,
                   "남", 152, 232, 47, NA, 42, 20, 568, 569,
                   "여", 48, 76, 21, 6, 9, 7, 136, 100)

y2016_4 <- tribble(~구분, ~프랑스, ~루마니아, ~엘살바도르, ~러시아, ~나이지리아, ~인도, ~아제르바이잔, ~싱가포르,
                   "계", 855, 53, 1, 80, 72, 716, 6, 80,
                   "남", 570, 30, NA, 40, 35, 434, 1, 49,
                   "여", 285, 23, 1, 40, 37, 282, 5, 31)

y2016_5 <- tribble(~구분, ~이란, ~네팔, ~캐나다, ~도미니카공화국, ~남아프리카공화국, ~덴마크, ~우크라이나, ~브라질,
                   "계", 22, 953, 74, 2, 51, 67, 30, 19,
                   "남", 13, 929, 50, 1, 32, 54, 15, 13,
                   "여", 9, 24, 24, 1, 19, 13, 15, 6)

y2016_6 <- tribble(~구분, ~뉴질랜드, ~독일, ~아일랜드, ~아이슬란드, ~튀니지, ~모리셔스, ~카자흐스탄, ~벨기에,
                   "계", 43, 30, 32, 7, 9, 1, 25, 10,
                   "남", 35, 22, 25, 5, 4, NA, 17, 7,
                   "여", 8, 8, 7, 2, 5, 1, 8, 3)

y2016_7 <- tribble(~구분, ~파키스탄, ~방글라데시, ~베네수엘라, ~폴란드, ~그리스, ~포르투갈, ~브루나이, ~스페인,
                   "계", 45, 8, 16, 34, 55, 18, 8, 9,
                   "남", 31, 7, 9, 22, 42, 13, 6, 4,
                   "여", 14, 1, 7, 12, 13, 5, 2, 5)

y2016_8 <- tribble(~구분, ~모로코, ~알제리, ~칠레, ~스웨덴, ~스위스, ~세르비아, ~탄자니아, ~앙골라,
                   "계", 5, 9, 2, 31, 2, 5, 1, 4,
                   "남", 2, 4, 1, 22, 1, 4, NA, 1,
                   "여", 3, 5, 1, 9, 1, 1, 1, 3)

y2016_9 <- tribble(~구분, ~레바논, ~불가리아, ~에코, ~크로아티아, ~터키, ~콜롬비아, ~멕시코, ~마다가스카르,
                   "계", 5, 11, 8, 17, 12, 7, 2, 1,
                   "남", 2, 4, 6, 14, 12, 4, 1, NA,
                   "여", 3, 7, 2, 3, NA, 3, 1, 1)

y2016_10 <- tribble(~구분, ~슬로바크, ~아르헨티나, ~가나, ~예멘공화국, ~아랍에미리트연합, ~핀란드, ~슬로베니아, ~홍콩,
                    "계", 2, 6, 4, 5, 1, 7, 1, 5,
                    "남", 2, 4, 3, 4, 1, 6, 1, 3,
                    "여", NA, 2, 1, 1, NA, 1, NA, 2)

y2016_11 <- tribble(~구분, ~케냐, ~`보스니아-헤르체코비나`, ~카타르, ~몬테네그로, ~라트비아, ~벨로루시, ~페루, ~시리아,
                    "계", 2, 1, 1, 1, 2, 1, 1, 1,
                    "남", NA, 1, NA, 1, 2, 1, 1, 1,
                    "여", 2, NA, 1, NA, NA, NA, NA, NA)

y2016_12 <- tribble(~구분, ~코트디부아르, ~이라크, ~헝가리, ~리투아니아, ~짐바브웨, ~파나마, ~아프가니스탄, ~오스트리아,
                    "계", 4, 1, 1, 2, 1, 1, 1, 1,
                    "남", 2, 1, 1, 2, 1, NA, 1, 1,
                    "여", 2, NA, NA, NA, NA, 1, NA, NA)

y2016_df <- y2016_1 %>% 
  left_join(y2016_2) %>% 
  left_join(y2016_3) %>% 
  left_join(y2016_4) %>% 
  left_join(y2016_5) %>% 
  left_join(y2016_6) %>% 
  left_join(y2016_7) %>% 
  left_join(y2016_8) %>% 
  left_join(y2016_9) %>% 
  left_join(y2016_10) %>% 
  left_join(y2016_11) %>% 
  left_join(y2016_12)

y2016_tidy <- y2016_df %>% 
  gather(year, population, `계`:`오스트리아`) %>% 
  spread(구분, population)

write_csv(y2016_tidy, "geoje/datasets/foreigner_2016.csv")

# 2015

y2015_1 <- tribble(~구분, ~소계, ~우즈베키스탄, ~베트남, ~한국계중국인, ~네팔, ~인도,  ~필리핀, ~스리랑카, ~인도네시아,
                  "계", 15051, 1324, 1234, 983, 959, 922, 751, 695, 662,
                  "남", 11092, 1256, 696 ,576 ,931 ,561 ,244 ,690 ,609,
                  "여", 3959, 68, 538, 407, 28, 361, 507, 5, 53)

y2015_2 <- tribble(~구분, ~중국, ~미얀마, ~말레이시아, ~타이, ~캄보디아, ~싱가포르, ~일본, ~티모르민주공화국, ~몽골,
                   "계", 604, 504, 452, 423, 183, 141, 111, 60, 56,
                   "남", 269, 495, 352, 360, 133, 99 ,39, 60, 39,
                   "여", 335, 9, 100, 63, 50, 42, 72, NA, 17)

y2015_3 <- tribble(~구분, ~파키스탄, ~타이완, ~이란, ~키르기스스탄, ~카자흐스탄, ~터키, ~방글라데시, ~브루나이, ~라오스,
                   "계", 24, 23, 23, 20, 19, 12, 11, 8, 4,
                   "남", 22, 14, 12, 14, 12, 10, 10, 5, NA,
                   "여", 2, 9, 11, 6, 7, 2, 1, 3, 4)

y2015_4 <- tribble(~구분, ~예멘공화국, ~레바논, ~아랍에미리트연합, ~오만, ~아프가니스탄, ~키프로스, ~이라크, ~요르단, ~시리아,
                   "계", 4, 3, 3, 2, 1, 1, 1, 1, 1,
                   "남", 3, 2, 3, 2, 1, 1, 1, 1, 1,
                   "여", 1, 1, NA, NA, NA, NA, NA, NA, NA)

y2015_5 <- tribble(~구분, ~미국, ~캐나다, ~브라질, ~베네수엘라, ~아르헨티나, ~콜롬비아, ~멕시코, ~볼리비아, ~도미니카공화국,
                   "계", 395, 82, 28, 17, 8, 7, 6, 2, 2,
                   "남", 325, 62, 18, 11, 5, 4, 2, 1, 1,
                   "여", 70, 20, 10, 6, 3, 3, 4, 1, 1)

y2015_6 <- tribble(~구분, ~칠레, ~쿠바, ~엘살바도르, ~파나마, ~노르웨이, ~프랑스, ~영국, ~덴마크, ~러시아,
                   "계", 1, 1, 1, 1, 1013, 811, 688, 124, 97,
                   "남", NA, NA, NA, NA, 832, 538, 575, 99, 46,
                   "여", 1, 1, 1, 1, 181, 273, 113, 25, 51)

y2015_7 <- tribble(~구분, ~네덜란드, ~독일, ~그리스, ~스웨덴, ~우크라이나, ~이탈리아, ~폴란드, ~아일랜드, ~루마니아,
                   "계", 74, 56, 54, 49, 49, 47, 42, 36, 31,
                   "남", 50, 46, 42, 37, 28, 38, 26, 26, 17,
                   "여", 24, 10, 12, 12, 21, 9 ,16 ,10 ,14)

y2015_8 <- tribble(~구분, ~포르투갈, ~크로아티아, ~스페인, ~벨기에, ~아제르바이잔, ~불가리아, ~아이슬란드, ~핀란드, ~오스트리아,
                   "계", 23, 20, 14, 13, 12, 11, 9, 8, 6,
                   "남", 16, 15, 6 ,8, 2, 6, 8, 4, 6,
                   "여", 7, 5, 8, 5, 10, 5, 1, 4, NA)

y2015_9 <- tribble(~구분, ~세르비아, ~체코, ~리투아니아, ~스위스, ~벨로루시, ~헝가리,  ~몬테네그로, ~마케도니아, ~슬로베니아,
                   "계", 6, 4, 4, 3, 2, 2, 2, 1, 1,
                   "남", 5, 4, 4, 1, 1, 1, 2, 1, 1,
                   "여", 1, NA, NA, 2, 1, 1, NA, NA, NA)

y2015_10 <- tribble(~구분, ~오스트레일리아, ~뉴질랜드, ~남아프리카공화국, ~나이지리아, ~알제리, ~튀니지, ~모로코, ~코트디부아르, ~가봉,
                    "계", 727, 47, 75, 73, 9, 9, 5, 4, 3,
                    "남", 505, 35, 56, 34, 4, 3, 2, 2, 1,
                    "여", 222, 12, 19, 39, 5, 6, 3, 2, 2)

y2015_11 <- tribble(~구분, ~콩고, ~짐바브웨, ~앙골라, ~카메룬, ~이집트, ~가나, ~케냐, ~모리셔스, ~탄자니아,
                    "계", 2, 2, 1, 1, 1, 1, 1, 1, 1,
                    "남", 2, 2, NA, 1, 1, 1, NA, NA, NA,
                      "여", NA, NA, 1, NA, NA, NA, 1, 1, 1)

y2015_df <- y2015_1 %>% 
  left_join(y2015_2) %>% 
  left_join(y2015_3) %>% 
  left_join(y2015_4) %>% 
  left_join(y2015_5) %>% 
  left_join(y2015_6) %>% 
  left_join(y2015_7) %>% 
  left_join(y2015_8) %>% 
  left_join(y2015_9) %>% 
  left_join(y2015_10) %>% 
  left_join(y2015_11)

y2015_tidy <- y2015_df %>% 
  gather(year, population, `소계`:`탄자니아`) %>% 
  spread(구분, population)

write_csv(y2015_tidy, "geoje/datasets/foreigner_2015.csv")

y2014_1 <- tribble(~구분, ~계, ~그리스, ~남아프리카공화국, ~네덜란드, ~네팔, ~노르웨이, ~뉴질랜드, ~덴마크,
                   "계", 13724, 75, 75, 87, 610, 811, 51, 98,
                   "남", 10114, 54, 59, 67, 599, 689, 40, 73,
                   "여", 3610, 21, 16, 11, 10, 122, 11, 25)

y2014_2 <- tribble(~구분, ~독일, ~러시아, ~루마니아, ~말레이지아, ~몽골, ~미국, ~미얀마, ~방글라데시,
                   "계", 36, 70, 29, 439, 60, 613, 369, 14,
                   "남", 30, 34, 15, 351, 46, 493, 360, 12,
                   "여", 6, 36, 14, 88, 14, 120, 9, 2)

y2014_3 <- tribble(~구분, ~베트남, ~벨기에, ~불가리아, ~브라질, ~스리랑카, ~스웨덴, ~스페인, ~싱가포르,
                   "계", 1137, 15, 14, 109, 586, 35, 12, 144,
                   "남", 650, 10, 7, 82, 582, 28, 7, 103,
                   "여", 487, 5, 7, 27, 4, 7, 5, 41)

y2014_4 <- tribble(~구분, ~아르헨티나, ~아일랜드, ~앙골라, ~영국, ~우즈베키스탄, ~우크라이나, ~이란, ~이집트,
                   "계", 6, 31, 11, 688, 1137, 53, 24, 7,
                   "남", 4, 21, 7, 575, 1087, 36, 16, 7,
                   "여", 2, 10, 4, 113, 50, 17, 8, NA)

y2014_5 <- tribble(~구분, ~이탈리아, ~인도, ~인도네시아, ~일본, ~중국, ~체코, ~카자흐스탄, ~캄보디아,
                   "계", 42, 848, 666, 88, 1441, 6, 15, 178,
                   "남", 35, 505, 615, 21, 789, 6, 12, 131,
                   "여", 7, 343, 51, 65, 652, NA, 3, 47)

y2014_6 <- tribble(~구분, ~캐나다, ~크로아티아, ~타이, ~타이완, ~터키, ~티모르민주공화국, ~파키스탄, ~폴란드,
                   "계", 87, 32, 323, 23, 10, 52, 25, 56,
                   "남", 67, 27, 267, 14, 8, 52, 24, 40,
                   "여", 20, 5, 56, 9, 2, NA, 1, 16)

y2014_7 <- tribble(~구분, ~프랑스, ~핀란드, ~필리핀, ~오스트리아, ~오스트레일리아, ~홍콩, ~기타,
                   "계", 682, 9, 781, 7, 675, 2, 230,
                   "남", 460, 6, 287, 7, 462, 2, 133,
                   "여", 222, 3, 494, NA, 213, NA, 97)

y2014_df <- y2014_1 %>% 
  left_join(y2014_2) %>% 
  left_join(y2014_3) %>% 
  left_join(y2014_4) %>% 
  left_join(y2014_5) %>% 
  left_join(y2014_6) %>% 
  left_join(y2014_7)

y2014_tidy <- y2014_df %>% 
  gather(year, population, 계:기타)

write_csv(y2014_tidy, "geoje/datasets/foreigner2014.csv")
