library(tidyverse)
library(ggthemes)

outsource_rate <- tribble(~year, ~engineer, ~manufacturer, ~officer, ~outsource,
1990, 7967, 34701, 4062, 7360,
1991, 6756, 33518, 5301, 7582,
1992, 7095, 32450, 5499, 7778,
1993, 7336, 31637, 7198, 10549,
1994, 9040, 36979, 9211, 15371,
1995, 11775, 39236, 7333, 18986,
1996, 12679, 40478, 7419, 20777,
1997, 11726, 40370, 6481, 19222,
1998, 12077, 38088, 6219, 19321,
1999, 10425, 36320, 6234, 18665,
2000, 10420, 36215, 7181, 25960,
2001, 10245, 36434, 7586, 32417,
2002, 11037, 36068, 6820, 40288,
2003, 11331, 36232, 7182, 38937,
2004, 11578, 36314, 7388, 42040,
2005, 12081, 35750, 7042, 49831,
2006, 14431, 36524, 7027, 55862)

outsource_rate %>% 
  gather(position, population, engineer:outsource) %>% 
  ggplot() +
  geom_line(aes(year, population, color = position)) +
  geom_text(aes(x=year, y=population, label = population), angle=45) +
  labs(title = "조선업 사내하청의 증가(1990~2006)", y = "명수", x = "연도")

write_csv(outsource_rate, "datasets/비율.csv")

outsource_rate %>% 
  mutate(rate = outsource / manufacturer) %>% 
  ggplot() + geom_point(aes(year, rate), color = "red", size = 1) +
  geom_line(aes(year, rate), color = "red") +
  geom_text(aes(x=year, y=rate, label=round(rate * 100, 1)), angle = 45) +
  geom_hline(yintercept = 1) +
  scale_y_continuous(limits = c(0, 2)) +
  labs(title = "조선업 사내하청의 증가", subtitle = "하청의 비율(원청 대비)")

ggsave("rate.png")

# 2002 to 2016

y2002_2016 <- tribble(~연도, ~부문별, ~사무직, ~기술직, ~직영_생산직, ~협력사_생산직, ~합계,
2002, "조선", 4634, 6600, 26771, 26890, 64895,  
2002, "비조선", 2186, 4437, 9297, 13398, 29318,
2003, "조선", 5086, 6921, 26866, 27963, 66836, 
2003, "비조선", 2096, 4410, 9366, 10974, 26846,
2004, "조선", 4619, 7250, 27799, 32113, 71781, 
2004, "비조선", 2769, 4328, 8515, 9927, 25539,
2005, "조선", 4745, 7993, 28868, 38967, 80573, 
2005, "비조선", 2297, 4088, 6882, 10864, 24131,
2006, "조선", 4920, 9759, 29843, 48863, 93385, 
2006, "비조선", 2107, 4672, 6681, 6999, 20459,
2007, "조선", 6015, 11806, 29938, 64686, 112445,
2007, "해양", 1026, 2197, 3171, 12442, 18836, 
2007, "기타", 1485, 3314, 4490, 3011, 12300,
2008, "조선", 5714, 13554, 30492, 68320, 118080,
2008, "해양", 1247, 2389, 3290, 11763, 18689, 
2008, "기타", 2427, 3445, 4794, 3896, 14562,
2009, "조선", 4721, 16360, 30897, 74998, 126976,
2009, "해양", 654, 3361, 3103, 15574, 22692, 
2009, "기타", 1359, 3532, 4435, 3753, 13079,
2010, "조선", 5267, 15656, 28481, 68342, 117746,
2010, "해양", 483, 3411, 3210, 14487, 21591, 
2010, "기타", 1698, 3869, 4884, 3981, 14432,
2011, "조선", 5135, 15870, 27997, 70555, 119557,
2011, "해양", 489, 3268, 3308, 15012, 22077, 
2011, "기타", 1968, 3668, 5139, 4441, 15216,
2012, "조선", 5202, 16188, 27109, 74625, 123124,
2012, "해양", 725, 3191, 3639, 23313, 30868, 
2012, "기타", 1919, 3402, 6210, 4370, 15901,
2013, "조선", 5738, 17015, 27822, 73483, 124058,
2013, "해양", 1055, 3471, 3888, 35576, 43990, 
2013, "기타", 2181, 2609, 5076, 5108, 14974,
2014, "조선", 6213, 15592, 26159, 84421, 132385,
2014, "해양", 1871, 4273, 4043, 43967, 54154, 
2014, "기타", 2464, 2780, 6397, 6455, 18096,
2015, "조선", 4447, 15263, 24732, 76869, 121311,
2015, "해양", 1803, 4305, 5550, 55116, 66774, 
2015, "기타", 2463, 3638, 5527, 3800, 15428,
2016, "조선", 7288, 5556, 23032, 62829, 98705,
2016, "해양", 2438, 2622, 4020, 40578, 49658, 
2016, "기타", 4894, 2433, 6036, 4551, 1791)

y2002_2016 %>% 
  select(-합계) %>% 
  group_by(연도) %>% 
  summarise(사무직=sum(사무직), 기술직=sum(기술직), 직영_생산직=sum(직영_생산직), 협력사_생산직=sum(협력사_생산직)) %>% 
  mutate(rate = 협력사_생산직 / 직영_생산직) %>% 
  ggplot(aes(연도, rate)) +
  geom_point(color = "red") + geom_line(color = "red") +
  geom_hline(yintercept = 1) +
  geom_text(aes(label = round(rate * 100, 1)), vjust = 0.3) +
  scale_y_continuous(limits = c(0, 5)) +
  labs(title = "조선업 사내하청의 증가", subtitle = "하청의 비율(원청 대비)")

y2002_2016 %>% 
  select(-합계) %>% 
  group_by(연도) %>% 
  summarise(사무직=sum(사무직), 기술직=sum(기술직), 직영_생산직=sum(직영_생산직), 협력사_생산직=sum(협력사_생산직)) %>% 
  gather(분류별, population, 사무직:협력사_생산직) %>% 
  ggplot(aes(연도, population)) +
  geom_line(aes(color = 분류별)) + geom_text(aes(label=population)) +
  labs(title = "조선업 사내하청의 증가(2002~2016)", y = "명수", x = "연도") +
  scale_x_continuous(breaks = c(seq(2002, 2016, 2))) +
  scale_y_continuous(breaks = c(seq(5000, 150000, 5000)), labels = scales::comma)
